In [202]:
import pandas as pd
import numpy as np

In [203]:
train = pd.read_csv('train.csv')
test = pd.read_csv('test.csv')

In [204]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [205]:
train.shape, test.shape

((891, 12), (418, 11))

In [206]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [207]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [208]:
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [209]:
test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [210]:
train_test_data = [train, test]
train_test_data

for dataset in train_test_data:
    dataset['Title'] = dataset['Name'].str.extract( '([A-Za-z]+)\.', expand=False)

In [211]:
train['Title'].value_counts().sum()

891

In [212]:
title_mapping={'Mr' : 0,
              'Miss' : 1,
              'Mrs' : 2,
              'Master' : 3,
              'Dr' : 3,
              'Rev' : 3,
              'Col' : 3,
              'Mlle' : 3,
              'Major' : 3,
              'Ms' : 3,
              'Countess' :3,
              'Capt' :3,
              'Lady' : 3, 
              'Don' : 3,
              'Jonkheer' : 3,
              'Sir' : 3,
              'Mme' : 3 }

In [213]:
for dataset in train_test_data:
    dataset['Title'] = dataset['Title'].map(title_mapping)

In [214]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0

In [215]:
train['Title'].value_counts().sum()

891

In [216]:
train.drop('Name', axis=1, inplace=True)
test.drop('Name', axis=1, inplace=True)

In [217]:
train.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C,2
2,3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,1,female,35.0,1,0,113803,53.1000,C123,S,2
4,5,0,3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [218]:
sex_mapping = {"male": 0, "female": 1}
train['Sex'] = train['Sex'].map(sex_mapping)
test['Sex'] = test['Sex'].map(sex_mapping)

In [219]:
train.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,1,0,3,0,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,1,38.0,1,0,PC 17599,71.2833,C85,C,2
2,3,1,3,1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,1,1,35.0,1,0,113803,53.1000,C123,S,2
4,5,0,3,0,35.0,0,0,373450,8.0500,NaN,S,0

In [220]:
train['Age'].fillna(train.groupby('Title')['Age'].transform('median'),inplace=True)
test['Age'].fillna(test.groupby('Title')['Age'].transform('median'),inplace=True)

In [221]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Sex          891 non-null    int64
 4   Age          891 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Ticket       891 non-null    object
 8   Fare         891 non-null    float64
 9   Cabin        204 non-null    object
 10  Embarked     889 non-null    object
 11  Title        891 non-null    int64
dtypes: float64(2), int64(7), object(3)
memory usage: 83.7+ KB

In [222]:
#Binning
for dataset in train_test_data:
  dataset.loc[dataset['Age'] <= 16, 'Age'] = 0
  dataset.loc[(dataset['Age'] > 16) & (dataset['Age'] <= 26), 'Age'] = 1
  dataset.loc[(dataset['Age'] > 26) & (dataset['Age'] <= 36), 'Age'] = 2
  dataset.loc[(dataset['Age'] > 36) & (dataset['Age'] <= 62), 'Age'] = 3
  dataset.loc[(dataset['Age']) > 62, 'Age'] = 4

In [223]:
train.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,1,0,3,0,1.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,1,3.0,1,0,PC 17599,71.2833,C85,C,2
2,3,1,3,1,1.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,1,1,2.0,1,0,113803,53.1000,C123,S,2
4,5,0,3,0,2.0,0,0,373450,8.0500,NaN,S,0

In [224]:
for dataset in train_test_data:
    dataset['Embarked'] = dataset['Embarked'].fillna('S')

In [225]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Sex          891 non-null    int64
 4   Age          891 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Ticket       891 non-null    object
 8   Fare         891 non-null    float64
 9   Cabin        204 non-null    object
 10  Embarked     891 non-null    object
 11  Title        891 non-null    int64
dtypes: float64(2), int64(7), object(3)
memory usage: 83.7+ KB

In [226]:
embarked_mapping = {'S' : 0, 'C' : 1, 'Q' : 2}
for dataset in train_test_data:
    dataset['Embarked'] = dataset['Embarked'].map(embarked_mapping)

In [227]:
train.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,1,0,3,0,1.0,1,0,A/5 21171,7.2500,NaN,0,0
1,2,1,1,1,3.0,1,0,PC 17599,71.2833,C85,1,2
2,3,1,3,1,1.0,0,0,STON/O2. 3101282,7.9250,NaN,0,1
3,4,1,1,1,2.0,1,0,113803,53.1000,C123,0,2
4,5,0,3,0,2.0,0,0,373450,8.0500,NaN,0,0

In [228]:
train['Fare'].fillna(train.groupby('Pclass')['Fare'].transform('median'), inplace=True)
test['Fare'].fillna(test.groupby('Pclass')['Fare'].transform('median'), inplace=True)

In [229]:
#Binning
for dataset in train_test_data:
  dataset.loc[dataset['Fare'] <= 17, 'Fare'] = 0
  dataset.loc[(dataset['Fare'] > 17) & (dataset['Fare'] <= 30), 'Fare'] = 1
  dataset.loc[(dataset['Fare'] > 30) & (dataset['Fare'] <= 100), 'Fare'] = 2
  dataset.loc[(dataset['Fare']) > 100, 'Fare'] = 3

In [230]:
train.Cabin.value_counts()

G6             4
C23 C25 C27    4
B96 B98        4
D              3
F2             3
              ..
D11            1
E38            1
D47            1
D50            1
C87            1
Name: Cabin, Length: 147, dtype: int64

In [231]:
for dataset in train_test_data:
  dataset['Cabin'] = dataset['Cabin'].str[:1]

In [232]:
cabin_mapping = {'A' : 0,
                 'B' : 0.4,
                 'C' : 0.8,
                 'D' : 1.2,
                 'E' : 1.6,
                 'F' : 2,
                 'G' : 2.4,
                 'T' : 2.8
                 }

for dataset in train_test_data:
  dataset['Cabin'] = dataset['Cabin'].map(cabin_mapping)

In [233]:
# fill missing Fare with median fare for each Pclass
train["Cabin"].fillna(train.groupby("Pclass")["Cabin"].transform("median"), inplace=True)
test["Cabin"].fillna(test.groupby("Pclass")["Cabin"].transform("median"), inplace=True)

In [234]:
train.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,1,0,3,0,1.0,1,0,A/5 21171,0.0,2.0,0,0
1,2,1,1,1,3.0,1,0,PC 17599,2.0,0.8,1,2
2,3,1,3,1,1.0,0,0,STON/O2. 3101282,0.0,2.0,0,1
3,4,1,1,1,2.0,1,0,113803,2.0,0.8,0,2
4,5,0,3,0,2.0,0,0,373450,0.0,2.0,0,0

In [235]:
train['FamilySize'] = train['SibSp'] + train['Parch'] + 1
test['FamilySize'] = test['SibSp'] + test['Parch'] + 1

In [236]:
family_mapping = {1 : 0,
                  2 : 0.4,
                  3 : 0.8,
                  4 : 1.2,
                  5 : 1.6,
                  6 : 2.0,
                  7 : 2.4,
                  8 : 2.8,
                  9 : 3.2,
                  10 : 3.6,
                  11 : 4.0
                 }

for dataset in train_test_data:
  dataset['FamilySize'] = dataset['FamilySize'].map(family_mapping)

In [237]:
# Feature Scaling - 머신러닝에서는 숫자를 사용하고 이 범위를 유의미하게 주어야 합니다.
# 예를 들어 남, 여를 앞에서 1과 0을 주었는데 이 둘의 차는 1입니다. 완전히 다른 의미의 것이 1의 차가 있는것이죠.
# 그런데 비용은 10달러와 20달러가 있을 때 10달러 차이밖에 나지 않지만, 둘의 차는 10입니다. 거의 비슷한 의미의 것이 차가 10이나 된다는 것이죠.
# 그래서 중요하지 않은 것은 소숫점을 줍니다!

cabin_mapping = {"A": 0, "B": 0.4, "C": 0.8, "D": 1.2, "E": 1.6, "F": 2, "G": 2.4, "T": 2.8}
for dataset in train_test_data:
    dataset['Cabin'] = dataset['Cabin'].map(cabin_mapping)

In [238]:
train.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title,FamilySize
0,1,0,3,0,1.0,1,0,A/5 21171,0.0,NaN,0,0,0.4
1,2,1,1,1,3.0,1,0,PC 17599,2.0,NaN,1,2,0.4
2,3,1,3,1,1.0,0,0,STON/O2. 3101282,0.0,NaN,0,1,0.0
3,4,1,1,1,2.0,1,0,113803,2.0,NaN,0,2,0.4
4,5,0,3,0,2.0,0,0,373450,0.0,NaN,0,0,0.0

In [239]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Sex          891 non-null    int64
 4   Age          891 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Ticket       891 non-null    object
 8   Fare         891 non-null    float64
 9   Cabin        0 non-null      float64
 10  Embarked     891 non-null    int64
 11  Title        891 non-null    int64
 12  FamilySize   891 non-null    float64
dtypes: float64(4), int64(8), object(1)
memory usage: 90.6+ KB

In [240]:
features_drop = ['Ticket', 'SibSp','Cabin', 'Parch', 'PassengerId']
train = train.drop(features_drop, axis=1)
test = test.drop(features_drop, axis=1)

In [241]:
train_data

     Pclass  Sex  Age  Fare  Cabin  Embarked  Title  FamilySize
0         3    0  1.0   0.0    NaN         0      0         0.4
1         1    1  3.0   2.0    NaN         1      2         0.4
2         3    1  1.0   0.0    NaN         0      1         0.0
3         1    1  2.0   2.0    NaN         0      2         0.4
4         3    0  2.0   0.0    NaN         0      0         0.0
..      ...  ...  ...   ...    ...       ...    ...         ...
886       2    0  2.0   0.0    NaN         0      3         0.0
887       1    1  1.0   1.0    NaN         0      1         0.0
888       3    1  1.0   1.0    NaN         0      1         1.2
889       1    0  1.0   1.0    NaN         1      0         0.0
890       3    0  2.0   0.0    NaN         2      0         0.0

[891 rows x 8 columns]

In [242]:
train_data = train.drop('Survived', axis=1)
target = train['Survived']

train_data.shape, target.shape

((891, 7), (891,))

In [243]:
#train_data = train.drop(['Survived_label', 'Pclass_label'], axis=1)

In [244]:
train_data.head()

   Pclass  Sex  Age  Fare  Embarked  Title  FamilySize
0       3    0  1.0   0.0         0      0         0.4
1       1    1  3.0   2.0         1      2         0.4
2       3    1  1.0   0.0         0      1         0.0
3       1    1  2.0   2.0         0      2         0.4
4       3    0  2.0   0.0         0      0         0.0

## Modeling

In [245]:
# Importing Classifier Modules
from sklearn.neighbors import KNeighborsClassifier
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier
from sklearn.naive_bayes import GaussianNB
from sklearn.svm import SVC

import numpy as np

In [246]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Survived    891 non-null    int64
 1   Pclass      891 non-null    int64
 2   Sex         891 non-null    int64
 3   Age         891 non-null    float64
 4   Fare        891 non-null    float64
 5   Embarked    891 non-null    int64
 6   Title       891 non-null    int64
 7   FamilySize  891 non-null    float64
dtypes: float64(3), int64(5)
memory usage: 55.8 KB

# Cross Validation(K-fold)

In [247]:
#Cross Validation(K-fold)
from sklearn.model_selection import KFold
from sklearn.model_selection import cross_val_score
k_fold = KFold(n_splits=10, shuffle=True, random_state=0)

### kNN

In [252]:
clf = KNeighborsClassifier(n_neighbors = 13)
scoring = 'accuracy'
score = cross_val_score(clf, train_data, target, cv=k_fold, n_jobs=1, scoring=scoring)
print(score)

[0.81111111 0.7752809  0.78651685 0.82022472 0.86516854 0.82022472
 0.85393258 0.80898876 0.83146067 0.83146067]

In [253]:
#kNN Score
round(np.mean(score)*100,2)

82.04

### Decision Tree(의사결정나무)

In [254]:
clf = DecisionTreeClassifier()
scoring = 'accuracy'
score = cross_val_score(clf, train_data, target, cv=k_fold, n_jobs=1, scoring=scoring)
print(score)

[0.8        0.82022472 0.7752809  0.75280899 0.86516854 0.78651685
 0.86516854 0.79775281 0.74157303 0.82022472]

In [255]:
#decision tree Score
round(np.mean(score)*100, 2)

80.25

### Random Forest

In [257]:
clf = RandomForestClassifier(n_estimators=13)
scoring = 'accuracy'
score = cross_val_score(clf, train_data, target, cv=k_fold, n_jobs=1, scoring=scoring)
print(score)

[0.81111111 0.82022472 0.79775281 0.75280899 0.84269663 0.80898876
 0.82022472 0.80898876 0.73033708 0.80898876]

In [258]:
#RandomForest score
round(np.mean(score)*100, 2)

80.02

### Naive Bayes

In [259]:
clf = GaussianNB()
scoring = 'accuracy'
score = cross_val_score(clf, train_data, target, cv=k_fold, n_jobs=1, scoring=scoring)
print(score)

[0.81111111 0.76404494 0.80898876 0.78651685 0.74157303 0.80898876
 0.82022472 0.82022472 0.82022472 0.83146067]

In [261]:
#naive bayes score
round(np.mean(score)*100, 2)

80.13

### SVM

In [263]:
clf = SVC()
scoring = 'accuracy'
score = cross_val_score(clf, train_data, target, cv=k_fold, n_jobs=1, scoring=scoring)
print(score)

[0.83333333 0.80898876 0.82022472 0.82022472 0.84269663 0.82022472
 0.84269663 0.85393258 0.84269663 0.85393258]

In [264]:
round(np.mean(score)*100, 2)

83.39

# Testing

In [270]:
test.head()

   Pclass  Sex  Age  Fare  Embarked  Title  FamilySize
0       3    0  2.0   0.0         2    0.0         0.0
1       3    1  3.0   0.0         0    2.0         0.4
2       2    0  3.0   0.0         2    0.0         0.0
3       3    0  2.0   0.0         0    0.0         0.0
4       3    1  1.0   0.0         0    2.0         0.8

In [275]:
test.isnull().sum()

Pclass        0
Sex           0
Age           0
Fare          0
Embarked      0
Title         1
FamilySize    0
dtype: int64

In [286]:
test['Title']

0      0.0
1      2.0
2      0.0
3      0.0
4      2.0
      ...
413    0.0
414    NaN
415    0.0
416    0.0
417    3.0
Name: Title, Length: 418, dtype: float64

In [288]:
test['Title'] = test['Title'].fillna(0)

In [289]:
test.isnull().sum()

Pclass        0
Sex           0
Age           0
Fare          0
Embarked      0
Title         0
FamilySize    0
dtype: int64

In [290]:
clf = SVC()
clf.fit(train_data, target)

test_data = test
prediction = clf.predict(test_data)

In [296]:
submission = pd.DataFrame({
        "Title" : test["Title"],
        "Survived": prediction
    })

submission.to_csv('submission.csv', index=False)

In [297]:
submission = pd.read_csv('submission.csv')
submission.head()

   Title  Survived
0    0.0         0
1    2.0         1
2    0.0         0
3    0.0         0
4    2.0         1